{
  "intents":
  [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day",
        "Greetings",
        "Hi there",
        "Hey there",
        "How's it going",
        "Hello?",
        "Good morning",
        "Good afternoon",
        "Good evening",
        "What's up",
        "Hi, can you help?",
        "Hello, anyone home?",
        "Hey, is this thing on?",
        "Hi, how are things?",
        "Hello, how are you today?"
      ],
      "responses": [
        "Hi there, what can I do for you?",
        "Hi there, how can I help?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
      "Bye",
      "See you later",
      "Goodbye",
      "I am done",
      "I don't need help",
      "Thanks for your help",
      "Farewell",
      "Catch you later",
      "I'm finished",
      "No more assistance needed",
      "Appreciate your assistance",
      "That's all for now",
      "Thanks, that's all I need",
      "Okay, I'm good now",
      "All set, thanks",
      "Thank you, I'm done",
      "Bye for now",
      "See you next time",
      "Goodbye, and thanks",
      "That's it, bye"],
      "responses": [
        "See you later, thanks for visiting, if you want to stop the chatbot interaction type 'quit'",
        "Have a nice day, if you want to stop the chatbot interaction type 'quit'"
      ]
    },
    {
      "tag": "thanks",
      "patterns": [
      "Thanks",
      "Thank you",
      "That's helpful",
      "Thanks a lot!",
      "Much appreciated",
      "Thank you very much",
      "That was really helpful",
      "I appreciate it",
      "Thanks so much",
      "Thank you, that's great",
      "Really appreciate your help",
      "Thanks, that's perfect",
      "Grateful for your assistance",
      "Thanks, you've been very helpful",
      "Thank you for the information",
      "That's exactly what I needed, thanks",
      "Thanks for your support",
      "Many thanks",
      "Cheers for the help",
      "Thanks, you've been helpful",
      "Okay, I'm good now"],
      "responses": ["Happy to help! if you want to stop the chatbot interaction type 'quit'", "Any time! if you want to stop the chatbot interaction type 'quit'", "My pleasure, if you want to stop the chatbot interaction type 'quit'"]
    },
    {
      "tag":"vagueQueries",
      "patterns":
      [
        "I am having some technical problems.",
        "I am facing some issues on my device.",
        "I need your help with something.",
        "There's a problem with my laptop; can you assist?",
        "My computer isn't working right; what should I do?",
        "Something is wrong with my device, can you help fix it?",
        "I am experiencing technical difficulties with my equipment.",
        "Can you help me troubleshoot an issue on my device?",
        "I am having trouble with my tech; what are my next steps?",
        "My device is acting up; how can I resolve this?"
      ],
      "responses":
      [
        "I am here to help with your technical problems. Could you please specify what issues you're experiencing with your device?",
        "Sure, I can assist you. What specific problems are you facing with your device right now?",
        "I would be happy to help. Please tell me more about the issues you're encountering.",
        "Let's tackle that problem together. Can you describe what's not working correctly on your device?",
        "What seems to be the problem? Please provide more details about what is happening, so I can offer the best assistance."
      ]
    },

    {
      "tag": "AccountCreationIssues",
      "patterns": ["I am having trouble setting up a new user account.",
      "Can't create an account, what should I do?",
      "Why is my account registration not going through?",
      "I keep getting an error when trying to sign up.",
      "What are the steps to register a new account?",
      "Account setup failed, what's next?",
      "I'm stuck on the account creation page, help?",
      "Is there an issue with your signup process right now?",
      "How do I start creating an account?",
      "The system won't let me register a new account.",
      "I received a 'registration unsuccessful' message, why?",
      "Why does my account creation keep failing?",
      "Is there a problem with account registrations today?",
      "I am unable to get past the account creation screen?",
      "Why is it so difficult to create an account?",
      "Signup issue, it says my details are incorrect.",
      "Why can't I proceed with creating my account?",
      "What requirements are there for new account creation?",
      "I'm not receiving the account verification email, what to do?",
      "Trouble with signing up, can someone assist?"
    ],
      "responses": ["It seems like there might be an issue with the account creation process. Could you double-check your input for any errors? Sometimes, simple things like an incorrect email format can cause trouble.",
      "the ITS team can help with account creation. Can you check whether all required fields are filled out correctly. If they are already correct, state in your query what the error message exactly says.",
      "Account setup problems? Try using a different web browser or clearing your current browser's cookies and cache"
      ]
    },
    {
      "tag": "LoginProblems",
      "patterns": [
        "I've forgotten my login details.",
        "I think I forgot my login details.",
        "I seem to have forgotten my login details",
        "I don't remember my password for login and want to reset",
        "I can't remember my password for login, how do i reset it?",
        "I am unable to remember my password for login, how do i reset it?",
        "What's the process for recovering a forgotten password?",
        "How do i initiate the process for recovering a forgotten password?",
        "I Lost my login credentials, need help.",
        "I can't remember my login credentials, please help.",
        "I am unable to remember my login credentials, help me.",
        "I forgot my username for login",
        "I can't remember my username for login",
        "I seem to have forgotten my username",
        "Need assistance with password recovery.",
        "Need assistance with username recovery.",
        "Can't log in because I forgot my password.",
        "Can't log in because I don't remember my password.",
        "Can't log in because I lost my password.",
        "What steps to take if I forgot my login details?",
        "What are the steps to take if I forgot my login details",
        "I don't have my login information, please help",
        "I don't remember my login info, help.",
        "I want to recover my login information, help."
      ],
      "responses": [
      "To reset username or password, click on 'forgot password' or 'forgot username' on the login page.",
      "if you need to login, use the 'Forgot Password' feature on our login screen. To get your username, use the 'Forgot Username' and follow the instructions.",
      "If you've forgotten your login details, Use the 'Forgot Password' or 'Forgot Username' links on our login page."
      ]
    },
    {
      "tag": "LockedAccount",
      "patterns": [
        "How do I unlock my account?",
        "Why is my account locked?",
        "My account is locked after trying to login many times, please help.",
        "How should I access my account if it's locked?",
        "I want help with unlocking my account.",
        "Can you help me unlock my account?",
        "What should I do if my account is locked?",
        "Help needed, my account is locked after several login attempts.",
        "How can I get into my locked account?",
        "Need assistance unlocking my account.",
        "How do I unlock my locked account?",
        "Why has my account been locked?",
        "My account got locked after multiple login tries, what should I do?",
        "What steps to take if my account is locked?",
        "I need support with unlocking my locked account.",
        "How to unlock my account, please?",
        "What causes my account to be locked?",
        "After many login attempts, my account is locked. Can you assist?",
        "How can I access my account when it's locked?",
        "Looking for help to unlock my account.",
        "How do I regain access to my locked account?",
        "Why did my account get locked?",
        "My account has been locked due to multiple failed login attempts, need help.",
        "What do I do if my account remains locked?",
        "I require help unlocking my account, please."
      ],
      "responses": [
        "Your account is locked, and for security reasons, you will need to wait for a period of time before trying again. However, you can reset your password for immediate access.",
        "Having a locked account can be frustrating. Typically, this lock lifts after a short while. However, if you need access sooner, resetting your password is the quickest option.",
        "Your account being locked is a security measure. For immediate access, reset your password. otherwise, try logging in later."
      ]
    },
    {
      "tag": "2FAProblems",
      "patterns": [
        "Having trouble with two-factor authentication.",
        "2FA code not working, what's wrong?",
        "Can't get past the two-factor authentication screen.",
        "Why isn't my authentication app working with your site?",
        "2FA setup issues, need guidance.",
        "Problems with two-factor authentication.",
        "My 2FA code doesn't work, what can I do?",
        "Unable to get through the two-factor authentication screen.",
        "What's the issue with my authentication app not working?",
        "Need help setting up 2FA.",
        "Struggling with two-factor authentication.",
        "2FA code failing, why is that?",
        "Stuck on the two-factor authentication page.",
        "Why doesn't my authentication app function with your website?",
        "Having issues setting up two-factor authentication.",
        "Trouble with my 2FA setup.",
        "What's wrong with my 2FA code?",
        "Can't bypass the two-factor authentication screen.",
        "My authentication app isn't syncing, what should I do?",
        "Guidance needed for 2FA issues.",
        "Experiencing problems with two-factor authentication.",
        "2FA code not working properly, any suggestions?",
        "Blocked at the two-factor authentication screen.",
        "Why is the authentication app not compatible with your site?",
        "Need assistance with two-factor authentication setup."
      ],
      "responses": [
        "Trouble with 2FA can often be solved by checking the time sync on your authentication app. Make sure it's correctly set. If problems persist, disabling and re-enabling 2FA might help.",
        "If your 2FA codes aren't working, let's first ensure your app is synchronized with the correct time. Sometimes, a simple time mismatch can cause issues.",
        "Two-factor authentication issues can be tricky. It might help to regenerate or sync the codes in your authentication app. If you're still stuck, we might need to temporarily disable 2FA to troubleshoot further."
      ]
    },
    {
      "tag": "ChangeUserDetails",
      "patterns": [
        "How do I update my email address in my account?",
        "Need to change my account phone number.",
        "What's the process for updating personal details?",
        "Can't figure out how to change my user information.",
        "How to modify my account details?",
        "How can I update my email in my profile?",
        "Looking to change my phone number on my account.",
        "How do I go about updating my personal information?",
        "Struggling to change my account details.",
        "What steps should I follow to modify my account details?",
        "What is the procedure to update my email address in my account?",
        "I need to update my contact number in my account.",
        "Can you tell me how to update personal details?",
        "I'm unsure how to update my user info.",
        "Instructions for modifying account information?",
        "How should I change my email address listed on my account?",
        "I want to update my phone number, how do I do that?",
        "Guide me through updating my personal details.",
        "How does one change their user information?",
        "What are the steps to update my account details?",
        "How can I change the email associated with my account?",
        "Need assistance changing my account's phone number.",
        "Could you help me with updating my personal information?",
        "Finding it difficult to modify my user details.",
        "How exactly do I alter my account details?"
      ],
      "responses": [
        "to change your details, navigate to 'Account Settings' after logging in and then click on 'update personal details'.",
        "If you are trying to change your details, first log in, then look for 'Account Settings' to find the options for updating your information.",
        "to update your personal settings. log in and head over to 'Account Settings'. There you can find 'update personal details'."
      ]
    },
    {
      "tag": "ChangePassword",
      "patterns": [
        "I want to change my password, how?",
        "Steps to reset my current password?",
        "Can't change my password, need help.",
        "How do I go about setting a new password?",
        "Process for password update, please?",
        "How can I change my password?",
        "What are the steps to reset my password?",
        "I'm having trouble changing my password, can you assist?",
        "Guide me on how to set a new password?",
        "Could you tell me the process for updating my password?",
        "I need to change my password, what should I do?",
        "Instructions for resetting my password?",
        "Help needed with password change.",
        "What's the procedure for setting a new password?",
        "Please explain the process for a password update.",
        "Want to change my password, what are the steps?",
        "How to reset my password?",
        "I can't seem to change my password, what should I do?",
        "Steps required to set up a new password?",
        "How do I proceed with updating my password?",
        "Change password guidance needed.",
        "How to initiate a password reset?",
        "Struggling to change my password, any tips?",
        "What is the method for setting a new password?",
        "Can you help with the password update process?"
      ],
      "responses": [
        "To change your password, log in and go to 'Account Settings,' then find the 'Change Password' option. If unable to login, use the 'Forgot Password' link on the login page to reset it.",
        "To update password, simply go to 'Account Settings' after logging in and select 'Change Password'. If locked out, click on 'Forgot Password' on login screen and follow instructions",
        "Need to reset your password? If you're logged in, go to 'Account Settings'. Otherwise The 'Forgot Password' link on our login page will guide you through the process."
      ]
    },
    {
      "tag": "2FASetup",
      "patterns": [
        "How to set up 2FA for my account?",
        "Want to enable two-factor authentication, guide me.",
        "Steps for activating 2FA?",
        "Need help setting up two-factor auth.",
        "How do I start using two-factor authentication?",
        "Can you help me set up 2FA on my account?",
        "I would like to enable two-factor authentication, can you assist?",
        "What are the steps to activate 2FA on my profile?",
        "Assistance needed for setting up two-factor authentication.",
        "How can I begin using two-factor auth?",
        "Instructions for setting up 2FA?",
        "Guide on how to enable two-factor authentication, please.",
        "How do I activate 2FA for my account?",
        "I need some help with two-factor authentication setup.",
        "Starting two-factor authentication, how do I proceed?",
        "How to configure 2FA on my account?",
        "Could you guide me through enabling 2FA?",
        "What do I need to do to activate two-factor auth?",
        "Help me get started with two-factor authentication.",
        "Procedure for setting up 2FA, please.",
        "How to initiate setting up 2FA?",
        "I want to start using two-factor authentication, what are the steps?",
        "Can you show me how to set up two-factor authentication?",
        "What's needed to enable 2FA on my account?",
        "How should I go about activating two-factor auth?"
      ],
      "responses": [
        "To enable 2FA, go to 'Account Settings' under the security options and follow the instructions.",
        "To activate two-factor authentication, go to 'Account Settings' and look for the 2FA option. Then follow the instructions.",
        "to set up 2FA, start by heading to 'Account Settings,' then navigate to the security or 2FA section."
      ]
    },
    {
      "tag": "AccountSynchronisation",
      "patterns": [
        "Why isn't my account data showing up on my other device?",
        "Data not syncing across platforms, what to do?",
        "Account info not updating on my phone, why?",
        "How do I ensure my account syncs across all devices?",
        "Troubleshooting account data synchronization issues?",
        "Why is my account data not appearing on my tablet?",
        "My data isn't syncing across my devices, can you help?",
        "Why isn't my account information updating on my other devices?",
        "What steps can I take to sync my account across all my devices?",
        "How to fix issues with account data not synchronizing?",
        "Account data not visible on my second device, what's wrong?",
        "What should I do if my data is not syncing across different platforms?",
        "Why is my phone not showing updated account info?",
        "Steps to ensure my account data is consistent across devices?",
        "How can I troubleshoot synchronization issues with my account?",
        "Why does my other device not show the latest account data?",
        "Help with data not syncing across my devices, what should I do?",
        "Account updates aren't appearing on my phone, why not?",
        "Instructions to sync account information across all devices?",
        "Need assistance with account data not syncing, any advice?",
        "Why isn't my account data consistent across all my devices?",
        "How do I resolve data synchronization issues across platforms?",
        "Why are my account details not updating on all my devices?",
        "Can you guide me on syncing my account data across devices?",
        "What can I do if my account information isn't syncing properly?",
        "The data related to my account does not sync over cloud"
      ],
      "responses": [
        "If your account data isn't syncing properly, try logging out and then back in on all devices. Sometimes a simple refresh is all it takes. Still stuck? There might be a sync option in your account settings.",
        "Sync issues can be a hassle. Check your internet connection first, as it's a common culprit. If that's fine, logging out and back in on each device often helps.",
        "For synchronization problems, ensuring all your devices are connected to the internet is a good first step. If issues persist, a manual sync option may be available in your account settings."
      ]
    },
    {
      "tag": "AccountDeletion",
      "patterns": [
        "How can I permanently delete my account?",
        "Steps to remove my account and all its data?",
        "I want to delete my account but ensure all data is gone.",
        "What's the process for full account deletion?",
        "Deleted my account but some data is still visible, why?",
        "How do I go about permanently deleting my account?",
        "Can you show me how to completely remove my account and its data?",
        "I need to delete my account and want to make sure no data remains.",
        "Guide me through the process of fully deleting my account.",
        "Why is there still data visible after I deleted my account?",
        "Instructions to permanently erase my account, please?",
        "How to ensure all my data is deleted when I remove my account?",
        "What are the steps for ensuring complete data deletion with account removal?",
        "I've tried to delete my account; why can I still see some of my data?",
        "What steps should I follow to delete my account forever?",
        "How can I make sure that all my information is wiped when I delete my account?",
        "Complete guide to removing my account and clearing all data?",
        "I want my account deleted with no trace left, how can I do that?",
        "Explain the process for a complete account and data deletion?",
        "Why does some of my information still show up after account deletion?",
        "What should I do to delete my account and all associated information permanently?",
        "How to fully remove my account and ensure all personal data is erased?",
        "I deleted my account; why are some details still appearing?",
        "Can you help me fully erase my account and all its contents?",
        "After deleting my account, some content is still there. What went wrong?"
      ],
      "responses": [
        "To delete your account, you can find this option under 'Account Settings.' Warning: This operation can't be undone!",
        "To permanently delete your account and all related data, go to the 'Delete Account' section within 'Account Settings.' It's important to note that this action cannot be undone.",
        "If you want to delete your account, visit 'Account Settings' and select 'Delete Account'."
      ]
    },
    {
      "tag": "WiFiEduroamConnection",
      "patterns": [
        "How do I connect to eduroam Wi-Fi?",
        "What are the steps to get my device on eduroam?",
        "Can you help me setup eduroam?",
        "What should I do to use eduroam on campus?",
        "Is there a guide for connecting to eduroam?",
        "I'm struggling to join eduroam, any advice?",
        "What's the process to access eduroam with my laptop?",
        "Can someone walk me through setting up eduroam?",
        "How to start using eduroam on my phone?",
        "Instructions for first-time eduroam connection?",
        "How can I connect my device to eduroam Wi-Fi?",
        "Steps needed to enable eduroam on my device?",
        "Could you assist me in setting up eduroam?",
        "Where can I find help for connecting to eduroam?",
        "Having trouble connecting to eduroam, what should I do?",
        "Detailed process to log into eduroam with my computer?",
        "I need help configuring eduroam, can you explain?",
        "What do I need to do to get eduroam working on my smartphone?",
        "Can you provide directions for a new eduroam user to connect?",
        "Tips on how to successfully connect to eduroam?",
        "What are the initial steps to connect to eduroam on campus?",
        "Assistance needed for eduroam setup, please?",
        "How do I get connected to eduroam with my tablet?",
        "Need instructions on making a first-time connection to eduroam.",
        "I am having problems setting up my device on the eduroam network.",
        "I can't connect my laptop to eduroam, what should I do?",
        "My phone won't connect to the eduroam Wi-Fi, can you help?",
        "How do I set up eduroam on my new device?",
        "I'm facing issues with connecting to eduroam, any suggestions?",
        "Why can't my device find the eduroam network?",
        "What are the steps to connect a device to eduroam?",
        "Can't set up eduroam on my device, need assistance.",
        "How do I troubleshoot my device's connection to eduroam?"],
      "responses": [
        "To connect to eduroam, you'll need your university credentials. select 'eduroam' from your Wi-Fi list and log in using student email and password.",
        "Simply choose 'eduroam' from your Wi-Fi settings and log in with your university email (e.g., *YourStudentNumber*@swansea.ac.uk) and your student password.",
        "For first-time setup, select eduroam from your Wi-Fi networks, and use your university email and password to log in. Ensure that you enter your full email address.",
        "To get connected, find 'eduroam' in your Wi-Fi networks. Log in with your university email address and password. Should you need more detailed instructions, your university IT support website likely has a guide specific to your device.",
        "First, select 'eduroam' from your device's Wi-Fi settings. Then, use your complete university email and password to sign in. For device-specific guidance, check out the IT support page on your university's website."
      ]
    },
    {
      "tag": "EduroamLoginIssues",
      "patterns": [
        "Why can't I log into eduroam?",
        "What should I do if I can't login to Eduroam?",
        "I am getting an error when accessing eduroam",
        "Is there a reason my eduroam login fails every time?",
        "My device won't connect to eduroam, any solutions?",
        "What to do if my eduroam connection keeps dropping?",
        "I'm having trouble re-connecting to eduroam, help?",
        "Why does eduroam say my credentials are incorrect?",
        "Failed to connect to eduroam, what am I doing wrong?",
        "Eduroam login issues, who can assist me?",
        "Trouble logging into eduroam, any tips?",
        "How can I fix my eduroam login problem?",
        "Receiving a login error on eduroam, what should I do?",
        "Continuous eduroam login failures, why does this happen?",
        "How to resolve connection issues with eduroam?",
        "Eduroam connection drops frequently, what's the fix?",
        "Need help reconnecting to eduroam, any advice?",
        "Eduroam is not accepting my credentials, what should I check?",
        "Why can't I successfully connect to eduroam?",
        "Who do I contact for eduroam login problems?",
        "Can't log in to eduroam, what steps should I take?",
        "Experiencing persistent eduroam access errors, how to resolve?",
        "Eduroam login continuously failing, how can I fix it?",
        "What should I do when my device refuses to connect to eduroam?",
        "Assistance needed: My eduroam access isn't working, who do I call?"],
      "responses": [
        "If you can't log into Eduroam, ensure you're using your full university email (*yourStudentNumber*@swansea.ac.uk) and the student password.",
        "Login issues are often due to incorrect credentials. Make sure to use your entire university email and current password. Consider resetting your password if the problem persists.",
        "Sometimes, forgetting the network and reconnecting can solve login problems. Just go to your Wi-Fi settings, forget 'eduroam' then try logging in again with your full university email and password.",
        "Errors during login could be due to a range of issues. Start by checking your credentials for typing mistakes. If that doesn't work, your device's network settings might need a reset. Your IT department can provide step-by-step guidance.",
        "Having trouble? Ensure you're entering your full email and correct password. If you've recently changed your password, you may need to update it on all your devices. Still stuck? Your university's IT support team is there to help."
      ]
    },
    {
      "tag": "EduroamInternetAccess",
      "patterns": [
        "Why does my connection to eduroam keep dropping?",
        "I'm connected to eduroam but don't have internet access.",
        "My eduroam Wi-Fi signal is really weak, any tips?",
        "Struggling to get my device online with eduroam.",
        "How can I improve my eduroam connection in my accommodation?",
        "Eduroam works everywhere but not in my building, why?",
        "Can't access certain sites on eduroam, is this normal?",
        "Eduroam is slow today, is the network down?",
        "I keep getting disconnected from eduroam, what's up?",
        "Why is my eduroam connection so unstable?",
        "Is there a way to boost my eduroam signal strength?",
        "Frequent drops in eduroam connection, how to fix?",
        "Connected to eduroam but can't surf the web, what's wrong?",
        "Weak eduroam signal, how can I make it stronger?",
        "How to enhance eduroam connectivity in my room?",
        "Eduroam not working in my building, any reason?",
        "Trouble accessing websites on eduroam, should I be concerned?",
        "Is there an outage with eduroam today, it's very slow?",
        "Constant disconnections from eduroam, any solution?",
        "Unstable eduroam network, how to stabilize?",
        "How do I increase the strength of my eduroam signal?",
        "Why does eduroam connection frequently drop off?",
        "I'm on eduroam but have no internet, what to do?",
        "Tips to boost weak Wi-Fi signal on eduroam?",
        "Improving eduroam internet quality in residential areas?",
        "Eduroam not functional in certain areas, what should I check?"],
      "responses": [
        "Connection issues? Start by checking if the problem occurs in multiple locations. If it's isolated to one area, the issue might be with local signal strength.",
        "For intermittent connectivity, try forgetting the eduroam network and reconnecting. If the problem persists across campus, there may be a wider network issue. Contact IT support for an update.",
        "Weak signals can often be improved by moving closer to a Wi-Fi access point. If you face this issue in your accommodation, contact IT support with this information so they consider signal extenders",
        "If connected to eduroam but no internet access, please disconnect connection, turn off VPN or firewall, then connect to eduroam. You can turn the VPN and firewall back on after connecting to eduroam."
      ]
    },
    {
      "tag":"LoanLaptop",
      "patterns":[
        "I want to borrow a laptop from the university.",
        "I would like to borrow a laptop from the library.",
        "I am going to borrow a laptop from lapsafe lockers at university in the library.",
        "Can I borrow a laptop from the university's library?",
        "How do I check out a laptop from the university library?",
        "Is it possible to borrow a laptop from the lapsafe lockers?",
        "What's the process to borrow a laptop from the library?",
        "Can you tell me how to get a laptop from the lapsafe lockers at the library?",
        "I need to borrow a laptop from the university's tech center.",
        "What steps should I follow to borrow a laptop from the university library?",
        "Where can I find a laptop to borrow at the university?",
        "I am interested in borrowing a laptop from the university library; how can I do that?",
        "Can I check out a laptop from the lapsafe lockers in the library?",
        "Instructions for borrowing a laptop from the library on campus, please.",
        "How can I reserve a laptop from the university library?",
        "What do I need to do to borrow a laptop from the lapsafe lockers at the university?",
        "Could you help me borrow a laptop from the university library?",
        "I am looking to borrow a laptop from the university; what are the steps?",
        "Guide me through borrowing a laptop from the lapsafe lockers in the library.",
        "Can anyone borrow a laptop from the university library?",
        "I would like to know more about borrowing laptops from the university.",
        "Is there a fee to borrow a laptop from the university library?",
        "Who do I contact to borrow a laptop from the library?",
        "What are the requirements to borrow a laptop from the university library?",
        "I would like to borrow a laptop. what are the instructions?",
        "i would like to borrow a laptop but I am facing issues",
        "I want to borrow a laptop but I am facing issues",
        "I want to return a laptop"
      ],
      "responses":[
        "To borrow or return a laptop, please visit the MyUni website, navigate to 'Academic Life', then 'IT Services', and select 'Laptop Services'. There you will find all the instructions you need. Remember, terms and conditions apply.",
        "You can borrow or return a laptop by following these steps: Go to MyUni, click on 'Academic Life', then 'IT Services', and finally 'Laptop Services'. Make sure to read and understand the terms and conditions",
        "For borrowing or returning a laptop, access the MyUni portal, choose 'Academic Life', go to 'IT Services', and click on 'Laptop Services'. Detailed instructions are available there. Please note that terms and conditions apply.",
        "Simply visit the MyUni site and follow this path: Academic Life > IT Services > Laptop Services. There you will find step-by-step instructions on how to borrow or return a laptop. Don't forget to check the terms and conditions.",
        "If you need to borrow or return a laptop, head over to the MyUni website, select 'Academic Life', then 'IT Services', and 'Laptop Services' for full instructions. Ensure you adhere to the terms and conditions stated."
      ]
    },
    {
      "tag":"ITSservicesLink",
      "patterns":
      [
        "Where do I raise a query with IT services?",
        "What is the link to the page where I can raise a query with IT services?",
        "How can I contact IT services with a question?",
        "Can you tell me how to submit a ticket to IT services?",
        "I need to send a query to IT services, where do I go?",
        "Where's the form to fill out for IT support?",
        "What's the procedure to raise a query with IT services?",
        "Where can I find the IT services contact page?",
        "How do I get in touch with IT for a support query?",
        "Is there a specific link for IT service requests?",
        "what's the link for IT support?"
      ],
      "responses":[
        "You can submit a query to the IT support team by navigating on our site: Go to 'Home', then 'The University', followed by 'Information Services and Systems', and click on 'IT Services'. From there, follow the links provided to submit your query.",
        "To reach out to our IT support team, start by clicking 'Home' on our site, select 'The University', then 'Information Services and Systems', and finally 'IT Services'. You will find relevant links there to submit your query.",
        "If you need to raise a query with IT support, visit our homepage, then click on 'The University', go to 'Information Services and Systems', and select 'IT Services'. You can submit your query through the links available there.",
        "For submitting a query to IT services, navigate from 'Home' > 'The University' > 'Information Services and Systems' > 'IT Services' on our website. Follow the relevant links there to get in touch with our IT support team.",
        "To get IT support, go to 'Home', then 'The University', 'Information Services and Systems', and 'IT Services' on our website. There, you will find the necessary links to submit any IT-related queries.",
        "You can find the page to raise a query with our IT support team by navigating through our website: 'Home' > 'The University' > 'Information Services and Systems' > 'IT Services'. Follow the links provided to submit your query.",
        "For IT support, please go to our website and follow this path: Home > The University > Information Services and Systems > IT Services. There you can find links to submit your queries to our IT team.",
        "Navigate to the 'IT Services' section by starting at 'Home', then going through 'The University' and 'Information Services and Systems'. From there, you can follow the necessary links to submit a query to our IT support team."
      ]
    },
    {
      "tag":"LinuxComputer",
      "patterns":
      [
        "Linux Login Problems",
        "Linux Login Failure",
        "Linux account login not working",
        "Trouble logging into Linux",
        "Can't log into my Linux account",
        "Linux login issue",
        "Linux user login error",
        "Problem with Linux account sign-in",
        "Linux login not responding",
        "Failed Linux account login attempt",
        "My Linux login won't work",
        "Unable to access Linux via login",
        "Linux desktop login problems",
        "Login failure on Linux system",
        "Linux server login error",
        "Linux machine can't log in",
        "Error during Linux login",
        "Linux login screen freezes",
        "Linux login unsuccessful",
        "Persistent login issues in Linux"
      ],
      "responses":
      [
        "It sounds like you're having trouble logging into Linux. Your username is the letter 'u' followed by your student number. Ensure that you are entering your details correctly. Otherwise email cosit@swansea.ac.uk for password reset",
        "Login issues can be frustrating. Please ensure Your username is the letter 'u' followed by your student number. Ensure that you are entering your details correctly and that your Caps Lock key is turned off. Otherwise email cosit@swansea.ac.uk for password reset",
        "If you're experiencing login failures, you might want to try resetting your password. You can email cosit@swansea.ac.uk for password reset",
        "I see you're having trouble with your Linux account login. Sometimes this can be caused by an expired password or account lock due to too many failed attempts. If not ensure your username is the letter 'u' followed by your student number, Ensure that you are entering your details correctly. If you need further assistance with linux, Email cosit@swansea.ac.uk for password reset!",
        "Can you state the exact error message in your query to the email cosit@swansea.ac.uk ?"
      ]
    }
  ]
}
